InformationRegisters/реа_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>реа_ПредопределенныеЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНеогрСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/реа_ОбщийСерверПовтИсп/Ext/Module.bsl
Функция ПолучитьПредопределенноеЗначение(Идентификатор, Параметр = Неопределено, СообщатьОбОшибке = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);		
	Если Идентификатор = "ДатаНачалаАвтоматическихРеализаций" Тогда
		Результат = Дата("30000101")
	Иначе
		Результат = Неопределено
	КонецЕсли; 
		
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПредопределенныеЗначения.Значение КАК Значение,
	|	ПредопределенныеЗначения.ЗначениеНеогрСтрока КАК ЗначениеНеогрСтрока
	|ИЗ
	|	РегистрСведений.реа_ПредопределенныеЗначения КАК ПредопределенныеЗначения
	|ГДЕ
	|	ПредопределенныеЗначения.Идентификатор = &Идентификатор
	|	И (ПредопределенныеЗначения.Параметр = НЕОПРЕДЕЛЕНО
	|			ИЛИ ПредопределенныеЗначения.Параметр = &Параметр)");
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	
	Выборка = Запрос.Выполнить().Выбрать();					   
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ЗначениеНеогрСтрока) Тогда
			Результат = Выборка.ЗначениеНеогрСтрока
		Иначе
			Результат = Выборка.Значение
		КонецЕсли		
	ИначеЕсли СообщатьОбОшибке Тогда
		ОписаниеОшибки = "Ошибка: не найдено предопределенное значение.
		|Идентификатор: " + Идентификатор + "
		|Параметр тип: " + ТипЗнч(Параметр) + "
		|Значение параметра " + Строка(Параметр) + "
		|
		|Пожалуйста, обратитесь к разработчику!";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки)	
	КонецЕсли;               
	
	Возврат Результат
	
КонецФункции
